// List of emojis supported by the FreeMobile API.
// This list contains emojis that have been tested and confirmed to work
// with the FreeMobile SMS API. All other emojis will be replaced during
// message sanitization to ensure compatibility.

pub const SUPPORTED_EMOJIS: &[&str] = &[
    "#️⃣", "*️⃣", "0️⃣", "1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣", "©️", "®️", "‼️", "⁉️",
    "™️", "ℹ️", "☀️", "☁️", "☂️", "☃️", "☄️", "☎️", "☑️", "☔", "☕️", "☘️", "☝️", "☠️", "☢️", "☣️",
    "☦️", "☪️", "☮️", "☯️", "☸️", "☹️", "☺️", "♀️", "♂️", "♈", "♉", "♊", "♋", "♌", "♍", "♎",
    "♏", "♐", "♑", "♒", "♓", "♟️", "♠️", "♣️", "♥️", "♦️", "♨️", "♻️", "♾️", "♿", "⚒️", "⚓",
    "⚔️", "⚕️", "⚖️", "⚗️", "⚙️", "⚛️", "⚜️", "⚠️", "⚡", "⚧️", "⚪", "⚫", "⚰️", "⚱️", "⚽", "⚾",
    "⛄", "⛅", "⛈️", "⛎", "⛏️", "⛑️", "⛓️", "⛔", "⛩️", "⛪", "⛰️", "⛱️", "⛲", "⛳", "⛴️", "⛵️",
    "⛷️", "⛸️", "⛹️", "⛺️", "⛽", "✂️", "✅", "✈️", "✉️", "✊", "✋", "✌️", "✍️", "✏️", "✒️", "✔️",
    "✖️", "✝️", "✡️", "✨", "✳️", "✴️", "❄️", "❇️", "❌", "❎", "❓", "❔", "❕", "❗", "❣️", "❤️",
    "➕", "➖", "➗", "➡️", "➰", "➿",
];

pub fn is_supported_emoji(emoji: &str) -> bool {
    SUPPORTED_EMOJIS.contains(&emoji)
}
